const btn = document.getElementById("btn");
const lower = document.querySelectorAll("lower");

let quote = [
  "जिस दिन आपने ये सीख लिया की सीखते कैसे है, फिर आप कुछ भी जीत सकते है",
  "सफल होने के लिए जुनून की बहुत जरूरत होती है ",
  "कुछ लोगों को उम्र नहीं जिम्मेदारी समझदार बना देती है ",
  "हारता वही है जो कुछ करता नहीं है ",
  "अपने आप को बनाने के लिए, अपने आप को दांव लगाना बहुत जरूरी है ",
  "सफल होने के लिए सबसे अच्छा नहीं, बल्कि अपने आप से सच्चा होना बहुत ज़रूरी है ",
  "जिन्हें अपने आप पर भरोसा होता है, उनका मुकाबला बस अपने आप के साथ होता है ",
  "जिस काम में दिल लगे वही करो, लेकिन ईमानदारी के साथ करो ",
  "अपने आप पर काम करना शुरू करो बांकी सब कुछ खुद ब खुद हो जाएगा ",
  "जिन्हें पता होता है की वो सही रास्तों पर चल रहे है, उन्हें किसी की परवाह नहीं होती ",
  "सफल होने के लिए ज़िद्दी होना बहुत ज़रूरी है",
  "अगर तुम चलने के लिए तैयार हो तो मंजिल तुम्हारे सामने झुकने के लिए तैयार हो जायेगी।",
  "जो अपनी शर्तों पर जीते है, वो कुछ कर सकता है",
  "जो सफलता का अर्थ समझे है, वो बहुत मेहनती होते है",
  "हम वही बनते है जो हम बार बार करते है",
  "मुश्किल समय ही हमें मजबूत बनाते है",
  "कुछ पाने की आस तो रख, कुछ तो अरमान रख जो हो खास, हर कोशिश में करे दरिया तू आर पार",
  "अगर आपको कोई काम करने में डर लग रहा है, तो आप सही कर रहें है",
  "जो संघर्ष कर सकता है, वो सफल भी हो सकता है",
];

btn.addEventListener("click", () => {
    console.log("clicked");
    let random = Math.floor(Math.random() * quote.length);
    document.querySelector('#lower').textContent = quote[random];
  });
  
